app/views/articles/_form.html.haml

= simple_form_for @article do |f|
  = f.collection_select :category_id, Category.all, :id, :name, {promt: "Choose a Category"}
---
SELECT "categories".* FROM "categories"