app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Sat6"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY created_at DESC  [["category_id", 1]]
---
  def index
    if params[:category].blank?
      @articles = Article.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @articles  = Article.where(category_id: @category_id).order("created_at DESC")

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test article"], ["content", "This is my wiki"], ["created_at", 2017-02-23 15:57:56 UTC], ["updated_at", 2017-02-23 15:57:56 UTC]]
---
  def create
   #@article = Article.new(article_params)
   @article = current_user.articles.build(article_params)
   if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "This is updated"], ["updated_at", 2017-02-23 19:27:56 UTC], ["id", 2]]
---
  def update
    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
  def destroy
    @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_article
   @article =Article.find(params[:id])